# YOLOv8n-cls + ECABlock
# 在 backbone 后两个 C2f 模块之后各插入一个 ECABlock

nc: 4

scales:
  n: [0.33, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]       # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]      # 1-P2/4
  - [-1, 3, C2f, [128, True]]       # 2-C2f
  - [-1, 1, Conv, [256, 3, 2]]      # 3-P3/8
  - [-1, 6, C2f, [256, True]]       # 4-C2f
  - [-1, 1, Conv, [512, 3, 2]]      # 5-P4/16
  - [-1, 6, C2f, [512, True]]       # 6-C2f
  - [-1, 1, ECABlock, [128]]        # 7-ECA after P4 stage
  - [-1, 1, Conv, [1024, 3, 2]]     # 8-P5/32
  - [-1, 3, C2f, [1024, True]]      # 9-C2f
  - [-1, 1, ECABlock, [256]]        # 10-ECA after P5 stage

head:
  - [-1, 1, Classify, [nc]]