# YOLOv8-Slim — 宽度缩放 slim 版
# 原始 yolov8n: scales n: [0.33, 0.25, 1024] → 1.45M params
# slim 版:     scales n: [0.25, 0.20, 1024] → ~0.95M params

nc: 4

scales:
  n: [0.25, 0.20, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 3, C2f, [128, True]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 6, C2f, [256, True]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 6, C2f, [512, True]]

  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 3, C2f, [1024, True]]

head:
  - [-1, 1, Classify, [nc]]